kvlh/szambo_zigbee/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c6"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Zigbee
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZED=y
CONFIG_ZB_ZCZR=n

# OTA
CONFIG_ESP_OTA_ALLOW_HTTP=y

# I2C
CONFIG_I2C_ISR_IRAM_SAFE=n

# Log level
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Console: UART only (USB-JTAG DTR causes download mode on ESP32-C6)
# No USB console to avoid download mode re-entry on port open

# Flash size (4MB for XIAO ESP32-C6)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Deep sleep: power down flash during sleep for lower current draw
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# mbedTLS (required for Zigbee)
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_HARDWARE_MPI=n
CONFIG_MBEDTLS_HARDWARE_SHA=n
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_ECJPAKE_C=y
